IDEA StatiCa Open Model
NationalAnnexCode Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Annex code
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum NationalAnnexCode
Public Enumeration NationalAnnexCode
public enum class NationalAnnexCode
Members
Member name | Value | Description
NoAnnex | 0 |  No national annex defined
Czech | 1 |  Czech national annex
Slovak | 2 |  Slovak national annex
Austrian | 3 |  Austria national annex
German | 4 |  Germany national annex
Dutch | 5 |  Dutch national annex
Belgian | 6 |  Belgian national annex
French | 7 |  France national annex
British | 8 |  British national annex
Singapore | 9 |  Singapore national annex
Polish | 10 |  Polish national annex
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace